PANDAS SERIES

In [ ]:
import numpy as np
import pandas as pd
file= 'ex1.csv'
df=pd.read_csv(file)
print(df.head())

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [12]:
obj=pd.Series([4,5,-7,6])
obj

0    4
1    5
2   -7
3    6
dtype: int64

In [58]:
obj2=pd.Series([4,5,-7,6], index=['b','a','c','d'])
obj2

b    4
a    5
c   -7
d    6
dtype: int64

In [63]:
obj3=obj2.reindex(['a','b','c','n'])
obj3

a    5.0
b    4.0
c   -7.0
n    NaN
dtype: float64

In [66]:
obj4=pd.Series(["blue","red","yellow"],index=[0,2,4])
obj4.reindex(np.arange(6), method='ffill') #fillna con il valore successivo

0      blue
1      blue
2       red
3       red
4    yellow
5    yellow
dtype: object

In [15]:
obj2[obj2>0]

a    4
b    5
d    6
dtype: int64

In [16]:
obj2*2

a     8
b    10
c   -14
d    12
dtype: int64

In [17]:
'b' in obj2

True

In [22]:

sdata={'Ohio': 35000, 'Texas': 71000, 'California': 38000,}
obj3=pd.Series(sdata)
obj3

Ohio          35000
Texas         71000
California    38000
dtype: int64

In [19]:
obj3.to_dict

<bound method Series.to_dict of ohio          35000
Texas         71000
California    38000
dtype: int64>

In [24]:
states=['Ohio','California','Nevada','Texas']
obj4=pd.Series(sdata, index=states)
obj4

Ohio          35000.0
California    38000.0
Nevada            NaN
Texas         71000.0
dtype: float64

In [31]:
pd.isna(obj4)
pd.notna(obj4)
obj4.isna()
obj4.notna()

Ohio           True
California     True
Nevada        False
Texas          True
dtype: bool

In [95]:
serie4 = pd.Series([1.,-999.,2.,-999.,-1000.,3.])

serie4.replace(-999, np.nan, inplace=True)
serie4[serie4>1]=np.nan 
serie4=serie4.where(serie4>1, np.nan)
serie4

0   NaN
1   NaN
2   NaN
3   NaN
4   NaN
5   NaN
dtype: float64

PANDAS DATAFRAMES

In [33]:
data={'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
      'year': [2000, 2001, 2002, 2001,2002,2003],
      'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

df=pd.DataFrame(data)
df

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [34]:
df.head()

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

In [ ]:
df.tail() #contrario, ultimi 5

    state  year  pop
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [38]:
df2=pd.DataFrame(data, columns=['year','state','pop','debt'])
df2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [40]:
df2['state'] 
df2.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64

In [ ]:
df2.loc[2]
df2.iloc[2]
#in questo caso simmetrici, ma loc riprende il nome, mentre iloc prende l'indice

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: 2, dtype: object

In [48]:
import numpy as np
df2['debt']=np.arange(6)
df2['pippo']=np.arange(3,9)
df2

   year   state  pop  debt  pippo
0  2000    Ohio  1.5     0      3
1  2001    Ohio  1.7     1      4
2  2002    Ohio  3.6     2      5
3  2001  Nevada  2.4     3      6
4  2002  Nevada  2.9     4      7
5  2003  Nevada  3.2     5      8

In [54]:
population= {'Ohio': {2000 :1.5, 2001:1.7, 2002:3.6},
             'Nevada': {2001:2.4, 2002:2.9}}
df3=pd.DataFrame(population)
df3

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [56]:
df3.index.name='year'
df3.columns.name='state'
df3

state  Ohio  Nevada
year
2000    1.5     NaN
2001    1.7     2.4
2002    3.6     2.9

In [72]:
new_df=pd.DataFrame([[1.4,np.nan],[7.1,-3.3],[np.nan,np.nan],[0.75,-2.2]],index =['a','b','c','d'], columns =['one','two'])
new_df

    one  two
a  1.40  NaN
b  7.10 -3.3
c   NaN  NaN
d  0.75 -2.2

In [75]:
new_df.sum(axis="columns",skipna=False)

a     NaN
b    3.80
c     NaN
d   -1.45
dtype: float64

In [ ]:
new_df.idxmax()
new_df.idxmin()

one    b
two    d
dtype: object

In [78]:
new_df.describe()

            one       two
count  3.000000  2.000000
mean   3.083333 -2.750000
std    3.493685  0.777817
min    0.750000 -3.300000
25%    1.075000 -3.025000
50%    1.400000 -2.750000
75%    4.250000 -2.475000
max    7.100000 -2.200000

In [79]:
data = pd.DataFrame({"food":["bacon","pulled pork","bacon","pastrami","corned beef", "bacon", "pastrami", "honey ham", "nova lox"], "ounces":[4,3,12,6,7.5,8,3,5,6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [83]:
meat_to_animal = {"bacon":"pig", "pulled pork":"pig", "pastrami":"cow", "corned beef":"cow", "honey ham":"pig", "nova lox":"salmon"}
data['animal'] = data['food'].map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [97]:
df = pd.DataFrame({"key1":["a", "a", None, "b", "b", "a", None],
"key2" : pd.Series([1, 2, 1, 2, 1, None, 1], dtype="Int64"),
"data1" : np.random.standard_normal(7),
"data2" : np.random.standard_normal(7)})

df

   key1  key2     data1     data2
0     a     1 -0.397973  1.159894
1     a     2  0.117547 -1.212325
2  None     1  2.241009 -0.099284
3     b     2  0.863982  1.424910
4     b     1 -0.643864 -0.352600
5     a  <NA>  0.839354 -0.566916
6  None     1  0.237766 -0.486816

In [100]:
df11=df["data1"].groupby(df["key1"])
df11.mean()

key1
a    0.186309
b    0.110059
Name: data1, dtype: float64

In [102]:
df12=df["data1"].groupby([df["key1"],df["key2"]])
df12.mean()

key1  key2
a     1      -0.397973
      2       0.117547
b     1      -0.643864
      2       0.863982
Name: data1, dtype: float64